## 🤖 Terraform Execution Plan
### 📁 gcp/terraform/storage-bucket
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_storage_bucket.test-bucket-002 must be replaced
-/+ resource "google_storage_bucket" "test-bucket-002" {
      - default_event_based_hold    = false -> null
      - enable_object_retention     = false -> null
      ~ id                          = "koushin-tanno-terraform-test-bucket-002" -> (known after apply)
      - labels                      = {} -> null
      ~ location                    = "ASIA-NORTHEAST1" -> "ASIA-NORTHEAST2" # forces replacement
        name                        = "koushin-tanno-terraform-test-bucket-002"
      ~ project                     = "vigilant-sol-474712-h0" -> (known after apply)
      ~ project_number              = 658458867755 -> (known after apply)
      ~ public_access_prevention    = "inherited" -> (known after apply)
      - requester_pays              = false -> null
      + rpo                         = (known after apply)
      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/koushin-tanno-terraform-test-bucket-002" -> (known after apply)
      ~ time_created                = "2025-11-16T01:55:26.003Z" -> (known after apply)
      ~ uniform_bucket_level_access = false -> (known after apply)
      ~ updated                     = "2025-11-16T01:55:26.003Z" -> (known after apply)
      ~ url                         = "gs://koushin-tanno-terraform-test-bucket-002" -> (known after apply)
        # (4 unchanged attributes hidden)

      - hierarchical_namespace {
          - enabled = false -> null
        }

      ~ soft_delete_policy (known after apply)
      - soft_delete_policy {
          - effective_time             = "2025-11-16T01:55:26.003Z" -> null
          - retention_duration_seconds = 604800 -> null
        }

      ~ versioning (known after apply)

      ~ website (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
